In [1]:
import pandas as pd

In [2]:
data = { 
    'Students' : ['mira','amir','izzat','zati','aziim','mat'],
    'Marks'    : [9,None,90,None,44,34]
}

In [3]:
df = pd.DataFrame(data)
df

  Students  Marks
0     mira    9.0
1     amir    NaN
2    izzat   90.0
3     zati    NaN
4    aziim   44.0
5      mat   34.0

In [4]:
# Missing data
print("Number of missing values are: \n", df.isnull().sum())

Number of missing values are:
 Students    0
Marks       2
dtype: int64

In [5]:
average_marks=df['Marks'].mean()
print(average_marks)

44.25

In [6]:
#replace missing data with average marks
df.fillna(average_marks,inplace=True)
df

  Students  Marks
0     mira   9.00
1     amir  44.25
2    izzat  90.00
3     zati  44.25
4    aziim  44.00
5      mat  34.00

#### fillna()

In [7]:
student_data = { 
    'Name' : ['mira','amir','izzat','zati','aziim','mat'],
    'Marks'    : [9,None,90,None,44,34]
}        
df = pd.DataFrame(student_data)
print(df)
df.isnull().sum()
df.fillna(df['Marks'].mean(),inplace=True)

    Name  Marks
0   mira    9.0
1   amir    NaN
2  izzat   90.0
3   zati    NaN
4  aziim   44.0
5    mat   34.0

In [8]:
#after cleaning data
df

    Name  Marks
0   mira   9.00
1   amir  44.25
2  izzat  90.00
3   zati  44.25
4  aziim  44.00
5    mat  34.00

#### Dropna()

In [9]:
student_data = { 'Name' : ['mira','amir','izzat','zati','aziim','mat'], 'Marks' : [9,None,90,None,44,34]}        
df = pd.DataFrame(student_data)
df = df.dropna(subset = ['Marks'])
df

    Name  Marks
0   mira    9.0
2  izzat   90.0
4  aziim   44.0
5    mat   34.0

In [10]:
student_data = { 'Name' : ['mira','amir',None,'zati','aziim','mat'], 'Marks' : [9,None,90,None,44,34]}        
df = pd.DataFrame(student_data)
df = df.dropna()
df

    Name  Marks
0   mira    9.0
4  aziim   44.0
5    mat   34.0

In [11]:
emp_data = {
    'Name' : ['mira','amir','izat','zati','aziim','mat'],
    'Age'  : [21,None,23,24,25,None],
    'salary' : [5000,3000,2000,4000,None,None]}
df = pd.DataFrame(emp_data)
print("OG Data")
df

OG Data

    Name   Age  salary
0   mira  21.0  5000.0
1   amir   NaN  3000.0
2   izat  23.0  2000.0
3   zati  24.0  4000.0
4  aziim  25.0     NaN
5    mat   NaN     NaN

In [12]:
print(df.isnull().sum())

Name      0
Age       2
salary    2
dtype: int64

In [13]:
df_drop = df.dropna()
df_drop

   Name   Age  salary
0  mira  21.0  5000.0
2  izat  23.0  2000.0
3  zati  24.0  4000.0

In [14]:
df_dropage= df.dropna(subset = ['Age'])
df_dropage

    Name   Age  salary
0   mira  21.0  5000.0
2   izat  23.0  2000.0
3   zati  24.0  4000.0
4  aziim  25.0     NaN

In [15]:
df_dropsal= df.dropna(subset = ['salary'])
df_dropsal

   Name   Age  salary
0  mira  21.0  5000.0
1  amir   NaN  3000.0
2  izat  23.0  2000.0
3  zati  24.0  4000.0

In [16]:

df.fillna({'Age': df['Age'].mean(), 'salary': df['salary'].mean()}, inplace=True)
df

    Name    Age  salary
0   mira  21.00  5000.0
1   amir  23.25  3000.0
2   izat  23.00  2000.0
3   zati  24.00  4000.0
4  aziim  25.00  3500.0
5    mat  23.25  3500.0